app/controllers/chats_controller.rb

SELECT "chats".* FROM "chats" WHERE "chats"."user_id" = ? ORDER BY "chats"."created_at" DESC  [["user_id", 980190963]]
---
  def index
    @chats = current_user.chats.order(created_at: :desc)

INSERT INTO "chats" ("created_at", "model_id", "updated_at", "user_id") VALUES (?, ?, ?, ?) RETURNING "id"  [["created_at", "2026-03-22 05:09:25.735120"], ["model_id", 1], ["updated_at", "2026-03-22 05:09:25.735120"], ["user_id", nil]]
INSERT INTO "models" ("capabilities", "context_window", "created_at", "family", "knowledge_cutoff", "max_output_tokens", "metadata", "modalities", "model_created_at", "model_id", "name", "pricing", "provider", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    prompt = params.dig(:chat, :prompt)
    if prompt.present?
      @chat = current_user.chats.create!(model: params.dig(:chat, :model).presence)

SELECT "chats".* FROM "chats" WHERE "chats"."user_id" = ? AND "chats"."id" = ? LIMIT ?  [["user_id", 980190963], ["id", 1], ["LIMIT", 1]]
---
  def set_chat
    @chat = current_user.chats.find(params[:id])