app/controllers/sessions_controller.rb

  def create
    auth = request.env["omniauth.auth"]
    user = User.find_or_initialize_by(google_uid: auth["uid"])
---
SELECT "users".* FROM "users" WHERE "users"."google_uid" = ? LIMIT ?  [["google_uid", "123"], ["LIMIT", 1]]